Tekla.Structures.Internal.Plugins.GetPluginDataFields(System.String,System.Collections.Generic.Dictionary{System.String,System.Reflection.FieldInfo}@)
Retrieves all possible attributes of the given plugin.
PluginName: Name of the plugin.
PluginDataFields: Dictionary of field names and their FieldInfo.
Returns:

Tekla.Structures.Internal.Plugins.LoadPluginAssembly(System.String)
Loads the plugin assembly from the disc or returns it from memory if it's already been loaded.

Tekla.Structures.Internal.Plugins.GetPluginFormFullName(System.String,System.String@)
Gets the complete name of the PluginForm of the Plugin.
PluginName: Name of the plugin.
PluginFormFullName: Complete name of the plugins form, null if it does not have one.
Returns: true if the name has been found, otherwise false

Tekla.Structures.Internal.Plugins.IsDrawingPlugin(System.String)
Checks if the plugin defined by the given PluginName is a drawing plugin or not.
PluginName: The name of the plugin.
Returns: True if the plugin is a drawing plugin otherwise false